In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
from sqlalchemy import create_engine, text

In [2]:
database_name = 'scooters'    

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

In [3]:
engine = create_engine(connection_string)

### Q16 Are there any null values in any columns in either table?
### part a: Null values in any columns in scooters table

In [4]:
query = '''
SELECT 
COUNT(*) AS total_rows,
SUM(CASE WHEN pubdatetime IS NULL THEN 1 ELSE 0 END) AS pubdatetime_null,
SUM(CASE WHEN latitude IS NULL THEN 1 ELSE 0 END) AS latitude_null,
SUM(CASE WHEN longitude IS NULL THEN 1 ELSE 0 END) AS longitude_null,
SUM(CASE WHEN sumdid IS NULL THEN 1 ELSE 0 END) AS sumdid_null,
SUM(CASE WHEN sumdtype IS NULL THEN 1 ELSE 0 END) AS sumdtype_null,
SUM(CASE WHEN chargelevel IS NULL THEN 1 ELSE 0 END) AS chargelevel_null,
SUM(CASE WHEN sumdgroup IS NULL THEN 1 ELSE 0 END) AS sumdgroup_null,
SUM(CASE WHEN costpermin IS NULL THEN 1 ELSE 0 END) AS costpermin_null,
SUM(CASE WHEN companyname IS NULL THEN 1 ELSE 0 END) AS companyname_null
FROM scooters;
'''
with engine.connect() as connection:    
    scooters = pd.read_sql(text(query), con = connection)

In [5]:
print(scooters)

   total_rows  pubdatetime_null  latitude_null  longitude_null  sumdid_null  \
0    73414043                 0              0               0            0

   sumdtype_null  chargelevel_null  sumdgroup_null  costpermin_null  \
0              0               770               0                0

   companyname_null
0                 0

In [6]:
### There are 770 null values in the chargelevel column in sccoters table.

### part b: Null values in any columns in trips table

In [7]:
query = '''
SELECT
    COUNT(*) AS total_rows,
    SUM(CASE WHEN pubtimestamp IS NULL THEN 1 ELSE 0 END) AS pubtimestamp_null,
    SUM(CASE WHEN companyname IS NULL THEN 1 ELSE 0 END) AS companyname_null,
    SUM(CASE WHEN triprecordnum IS NULL THEN 1 ELSE 0 END) AS triprecordnum_null,
    SUM(CASE WHEN sumdid IS NULL THEN 1 ELSE 0 END) AS sumdid_null,
    SUM(CASE WHEN tripduration IS NULL THEN 1 ELSE 0 END) AS tripduration_null,
    SUM(CASE WHEN tripdistance IS NULL THEN 1 ELSE 0 END) AS tripdistance_null,
    SUM(CASE WHEN startdate IS NULL THEN 1 ELSE 0 END) AS startdate_null,
    SUM(CASE WHEN starttime IS NULL THEN 1 ELSE 0 END) AS starttime_null,
    SUM(CASE WHEN enddate IS NULL THEN 1 ELSE 0 END) AS enddate_null,
    SUM(CASE WHEN endtime IS NULL THEN 1 ELSE 0 END) AS endtime_null,
    SUM(CASE WHEN startlatitude IS NULL THEN 1 ELSE 0 END) AS startlatitude_null,
    SUM(CASE WHEN startlongitude IS NULL THEN 1 ELSE 0 END) AS startlongitude_null,
    SUM(CASE WHEN endlatitude IS NULL THEN 1 ELSE 0 END) AS endlatitude_null,
    SUM(CASE WHEN endlongitude IS NULL THEN 1 ELSE 0 END) AS endlongitude_null,
    SUM(CASE WHEN triproute IS NULL THEN 1 ELSE 0 END) AS triproute_null,
    SUM(CASE WHEN create_dt IS NULL THEN 1 ELSE 0 END) AS create_dt_null
FROM trips;
'''

with engine.connect() as connection:    
    trips = pd.read_sql(text(query), con = connection)

In [8]:
print(trips)

   total_rows  pubtimestamp_null  companyname_null  triprecordnum_null  \
0      565522                  0                 0                   0

   sumdid_null  tripduration_null  tripdistance_null  startdate_null  \
0            0                  0                  0               0

   starttime_null  enddate_null  endtime_null  startlatitude_null  \
0               0             0             0                   0

   startlongitude_null  endlatitude_null  endlongitude_null  triproute_null  \
0                    0                 0                  0               0

   create_dt_null
0               0

In [9]:
# There are no null values in the table trips

### Q17  What date range is represented in each of the date columns? 
### Investigate any values that seem odd.

In [10]:
query = '''
WITH scooters_date_range AS (
SELECT MIN(pubdatetime) AS min_pubdatetime, MAX(pubdatetime) AS max_pubdatetime
FROM scooters
),
trips_date_range AS (
 SELECT MIN(pubtimestamp) AS min_pubtimestamp, MAX(pubtimestamp) AS max_pubtimestamp
    FROM trips
)
SELECT 
    'scooters' AS tablename,
    min_pubdatetime AS min_date, 
    max_pubdatetime AS max_date
FROM scooters_date_range
UNION ALL
SELECT 
    'trips' AS tablename,
    min_pubtimestamp AS min_date,
    max_pubtimestamp AS max_date
FROM trips_date_range;

    '''

with engine.connect() as connection:    
    datetime_scooters_trips = pd.read_sql(text(query), con = connection)

In [11]:
print(datetime_scooters_trips)

  tablename                min_date            max_date
0  scooters 2019-05-01 00:01:41.247 2019-07-31 23:59:57
1     trips 2019-05-01 00:00:55.423 2019-08-01 07:04:00

### Q18 Is time represented with am/pm or using 24 hour values22 in each of the columns that include time?

In [12]:
query ='''
SELECT DISTINCT pubdatetime
FROM scooters
'''

with engine.connect() as connection:
    time_format_scooters = pd.read_sql(text(query),  con = connection)

In [13]:
time_format_scooters

                    pubdatetime
0       2019-05-01 00:01:41.247
1       2019-05-01 00:02:25.383
2       2019-05-01 00:02:34.753
3       2019-05-01 00:02:48.740
4       2019-05-01 00:02:59.247
...                         ...
9175721 2019-07-31 23:58:18.267
9175722 2019-07-31 23:58:32.950
9175723 2019-07-31 23:59:15.753
9175724 2019-07-31 23:59:43.000
9175725 2019-07-31 23:59:57.000

[9175726 rows x 1 columns]

In [14]:
### From the result confirms that all columns from scooters table use the 24-hour time format.

In [15]:
query ='''

SELECT DISTINCT pubtimestamp, starttime, endtime
FROM trips
'''

with engine.connect() as connection:
    time_format_trips = pd.read_sql(text(query),  con = connection)

In [16]:
time_format_trips

                  pubtimestamp        starttime          endtime
0      2019-07-30 23:59:23.207         23:37:05         23:39:56
1      2019-07-20 15:57:53.300         15:09:32         15:19:27
2      2019-07-28 23:02:32.650  22:50:51.010000  23:04:26.826666
3      2019-07-31 23:09:08.217         23:00:48         23:05:09
4      2019-07-31 20:49:03.800         20:39:22         20:45:32
...                        ...              ...              ...
564610 2019-06-25 19:54:13.157         19:19:21         19:21:09
564611 2019-06-30 22:43:01.580  22:04:57.226666  22:43:01.456666
564612 2019-06-08 00:51:28.307         23:53:47         00:07:28
564613 2019-06-25 01:14:06.187  00:38:12.680000  01:14:06.050000
564614 2019-07-02 21:55:09.893         20:37:46         21:03:05

[564615 rows x 3 columns]

In [17]:
### From the result confirms that all columns from trips use the 24-hour time format.

### Q19- What values are there in the sumdgroup column? Are there any that are not of interest for this project?

In [18]:
query ='''

SELECT DISTINCT sumdgroup
FROM scooters
'''

with engine.connect() as connection:
    sumdgroup_values = pd.read_sql(text(query),  con = connection)

In [19]:
print(sumdgroup_values)

  sumdgroup
0   bicycle
1   scooter
2   Scooter

In [20]:
### There are bicycle, scooter values in sumdgroup column. bicycle is not of interest for this project.

### Q20- What are the minimum and maximum values for all the latitude and longitude columns? Do these ranges make sense, or is there anything surprising?

In [21]:
query ='''

SELECT MIN(latitude) AS min_latitude, MAX(latitude) AS max_latitude
FROM scooters
'''

with engine.connect() as connection:
   lat_result = pd.read_sql(text(query),  con = connection)

In [22]:
lat_result

   min_latitude  max_latitude
0           0.0  3.609874e+06

In [23]:
query ='''

SELECT MIN(longitude) AS min_longitude, MAX(longitude) AS max_longitude
FROM scooters
'''

with engine.connect() as connection:
   lon_result = pd.read_sql(text(query),  con = connection)

In [24]:
print(lon_result)

   min_longitude  max_longitude
0     -97.443879            0.0

### Q21-What is the range of values for trip duration and trip distance? Do these values make sense? Explore values that might seem questionable.

In [25]:
query ='''

SELECT MIN(tripduration) AS min_tripduration, MAX(tripduration) AS max_tripduration, MIN(tripdistance) AS min_tripdistance, MAX(tripdistance) AS max_tripdistance
FROM trips
'''

with engine.connect() as connection:
   result = pd.read_sql(text(query),  con = connection)

In [26]:
result

   min_tripduration  max_tripduration  min_tripdistance  max_tripdistance
0        -19.358267          512619.0       -20324803.8      3.188448e+07

In [27]:
### The negative value (-19.358267) for min_tripduration does not make sense, as trip durations are expected to be non-negative.

### Q22- Check out how the values for the company name column in the scooters table compare to those of the trips table. What do you notice?

In [28]:
query ='''

select distinct companyname
FROM scooters
'''

with engine.connect() as connection:
   result_scooters = pd.read_sql(text(query),  con = connection)

In [29]:
result_scooters

  companyname
0        Bird
1        Bolt
2      Gotcha
3        Jump
4        Lime
5        Lyft
6        Spin

In [30]:
query = '''
SELECT distinct companyname
FROM trips
'''

with engine.connect() as connection:
    result_trips = pd.read_sql(text(query),  con = connection)

In [31]:
result_trips

     companyname
0           Bird
1  Bolt Mobility
2         Gotcha
3           JUMP
4           Lime
5           Lyft
6           SPIN

In [32]:
### I noticed that in the 'scooters' table, all company names have the first letter of each word capitalized.

### In the 'trips' table, the capitalization of company names is inconsistent, with the lack of uniform style for writing company names in the 'trips' table.